app/controllers/home_controller.rb

SELECT "wishes".* FROM "wishes"
---
  def show

  @wishes = Wish.find :all