app/controllers/wishes_controller.rb

INSERT INTO "wishes" ("anonymous", "created_at", "name", "secret", "updated_at", "your_wish") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["anonymous", nil], ["created_at", Tue, 20 Sep 2011 07:13:43 UTC +00:00], ["name", "sdfg"], ["secret", nil], ["updated_at", Tue, 20 Sep 2011 07:13:43 UTC +00:00], ["your_wish", "sdfgsdfg"]]
---
  def create

    w = Wish.create(:name => params[:name], :your_wish => params[:your_wish])